In [2]:
import pandas as pd
import numpy as np
import FinanceDataReader as fdr

# To print multiple outputs in a cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# Display data to three deciaml places.
pd.set_option('display.float_format', lambda x: '%.3f' % x)

# To print all columns
pd.set_option('max_columns', None)

## data used

In [3]:
code_stock_name = pd.Series(np.array(['NETFLIX', 'Amazon', 'Apple', 'Microsoft', 'NVIDIA', 'Tesla', 
                                     'Autodesk', 'NIKE', 'Pfizer', 'Disney']))
use_stock = pd.DataFrame(
    {
        'stock_name': code_stock_name
    }
)
use_stock.index = np.arange(1,len(use_stock) + 1) # start row index from 1 instead of zero. 

use_stock

   stock_name
1     NETFLIX
2      Amazon
3       Apple
4   Microsoft
5      NVIDIA
6       Tesla
7    Autodesk
8        NIKE
9      Pfizer
10     Disney

## load datasets
* Getting the NASDAQ Symbols in [here](https://finance.yahoo.com/)
* Date : '2015-01-01' to '2021-11-25'

In [4]:
NETFLIX_df = fdr.DataReader("NFLX", '2015-01-01', '2021-11-25')
AMAZON_df = fdr.DataReader("AMZN", '2015-01-01', '2021-11-25')
APPLE_DF = fdr.DataReader("AAPL", '2015-01-01', '2021-11-25')
MICROSOFT_df = fdr.DataReader("MSFT", '2015-01-01', '2021-11-25')
NVIDIA_df = fdr.DataReader("NVDA", '2015-01-01', '2021-11-25')
TESLA_dF = fdr.DataReader("TSLA", '2015-01-01', '2021-11-25')
AUTODESK_DF = fdr.DataReader("ADSK", '2015-01-01', '2021-11-25')
NIKE_DF = fdr.DataReader("NKE", '2015-01-01', '2021-11-25')
PFIZER_DF = fdr.DataReader("PFE", '2015-01-01', '2021-11-25')
DISNEY_DF = fdr.DataReader("DIS", '2015-01-01', '2021-11-25')

NETFLIX_df.shape
AMAZON_df.shape
APPLE_DF.shape
MICROSOFT_df.shape
NVIDIA_df.shape
TESLA_dF.shape
AUTODESK_DF.shape
NIKE_DF.shape
PFIZER_DF.shape
DISNEY_DF.shape

(1739, 6)

(1739, 6)

(1738, 6)

(1739, 6)

(1739, 6)

(1739, 6)

(1738, 6)

(1738, 6)

(1738, 6)

(1738, 6)

In [8]:
# The shape is not the same because of several reasons.
# First, Suspended trading occurs because of serious concerns about a company's assets, 
# operations, or other financial information.
# Second, a Trading halt is implemented to correct an order imbalance,
# Third, If the provider omits a specific day's data
# etc..
# So we must match the shape because of the imbalance.

# In this project, I'll take df1(NFLX) as a criteria.


# using 'reindex' to make the same shape
APPLE_df = APPLE_DF.reindex(NETFLIX_df.index)
AUTODESK_df = AUTODESK_DF.reindex(NETFLIX_df.index)
NIKE_df = NIKE_DF.reindex(NETFLIX_df.index)
PFIZER_df = PFIZER_DF.reindex(NETFLIX_df.index)
DISNEY_df = DISNEY_DF.reindex(NETFLIX_df.index)

# Check : Is the Shape the same? 이부분은 나중에 출력에서 지우기
APPLE_df.shape
AUTODESK_df.shape
NIKE_df.shape
PFIZER_df.shape
DISNEY_df.shape

# Fill the data 
# pandas.DataFrame.fillna : Fill NA/NaN values using the specified method.
# "ffill" : forward fill
APPLE_df.fillna(method="ffill").head()
AUTODESK_df.fillna(method="ffill").head()
NIKE_df.fillna(method="ffill").head()
PFIZER_df.fillna(method="ffill").head()
DISNEY_df.fillna(method="ffill").head()

(1739, 6)

(1739, 6)

(1739, 6)

(1739, 6)

(1739, 6)

            Close   Open   High    Low        Volume  Change
Date
2015-01-02 27.330 27.850 27.860 26.840 212820000.000  -0.009
2015-01-05 26.560 27.070 27.160 26.350 257140000.000  -0.028
2015-01-06 26.570 26.640 26.860 26.160 263190000.000   0.000
2015-01-07 26.940 26.800 27.050 26.670 160420000.000   0.014
2015-01-08 27.970 27.310 28.040 27.180 237460000.000   0.038

            Close   Open   High    Low      Volume  Change
Date
2015-01-02 59.530 60.060 60.490 58.950  901930.000  -0.009
2015-01-05 58.660 59.150 59.440 58.460 2130000.000  -0.015
2015-01-06 57.500 58.890 59.220 57.310 1940000.000  -0.020
2015-01-07 57.380 57.780 58.520 57.100 1220000.000  -0.002
2015-01-08 58.800 57.870 59.130 57.740 1310000.000   0.025

            Close   Open   High    Low      Volume  Change
Date
2015-01-02 47.520 48.270 48.480 47.050 4990000.000  -0.012
2015-01-05 46.750 47.260 47.270 46.560 6890000.000  -0.016
2015-01-06 46.480 46.950 47.080 46.030 7580000.000  -0.006
2015-01-07 47.440 46.800 47.650 46.550 7260000.000   0.021
2015-01-08 48.530 47.830 48.550 47.810 6000000.000   0.023

            Close   Open   High    Low       Volume  Change
Date
2015-01-02 29.700 29.640 30.130 29.590 15530000.000   0.006
2015-01-05 29.540 29.720 29.780 29.400 23520000.000  -0.005
2015-01-06 29.780 29.640 30.200 29.500 27960000.000   0.008
2015-01-07 30.190 30.070 30.210 29.940 19210000.000   0.014
2015-01-08 30.810 30.660 30.940 30.540 46650000.000   0.020

            Close   Open   High    Low      Volume  Change
Date
2015-01-02 93.750 94.910 95.280 92.850 5870000.000  -0.005
2015-01-05 92.380 93.280 93.350 91.780 7790000.000  -0.015
2015-01-06 91.890 92.570 93.190 91.160 6800000.000  -0.005
2015-01-07 92.830 92.720 93.150 92.100 6590000.000   0.010
2015-01-08 93.790 93.870 94.300 93.560 7580000.000   0.010

In [6]:
APPLE_df.nunique()

Close     1475
Open      1474
High      1473
Low       1483
Volume    1643
Change     621
dtype: int64